{"keras_version": "2.0.2", "config": [{"config": {"bias_regularizer": null, "activity_regularizer": null, "strides": [1, 1], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "batch_input_shape": [null, 150, 150, 3], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "data_format": "channels_last", "filters": 32, "dilation_rate": [1, 1], "name": "conv2d_1", "activation": "linear", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "data_format": "channels_last", "filters": 32, "dilation_rate": [1, 1], "name": "conv2d_2", "activation": "linear", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "padding": "valid", "data_format": "channels_last", "filters": 64, "dilation_rate": [1, 1], "name": "conv2d_3", "activation": "linear", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "units": 64, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "name": "dense_1", "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "units": 8, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "bias_constraint": null, "name": "dense_2", "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_5", "activation": "sigmoid"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow"}