{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "kernel_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "data_format": "channels_last", "strides": [1, 1], "batch_input_shape": [null, 150, 150, 3], "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "filters": 32, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "kernel_size": [3, 3], "dtype": "float32"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "filters": 32, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_2", "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_3", "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_regularizer": null, "padding": "valid", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense_1", "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "name": "dense_2", "kernel_constraint": null, "activation": "linear", "bias_regularizer": null, "activity_regularizer": null, "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_5"}}], "backend": "tensorflow"}